package phr_solution;

/*
* ======== 개인 건강 기록 (PHR: Personal Health Record) 솔루션 ========
* 1. 프로젝트 개요
* : 개인 건강 기록 (PHR) 솔루션을 위한 간단한 콘솔 기반 응용 프로그램
*   - 환자의 기본 정보를 관리, 환자의 건강 기록을 등록, 수정, 조회 가능
*   - 특정 조건에 맞는 건강 기록을 필터링하고 집계하는 기능을 제공
*
* 2. 주요 기능 및 비즈니스 로직
* : 환자 정보 관리
*   - CR(전체, 단건)UD
* : 건강 기록 관리
*   - CRUD + 필터링(조회)
*
* 3. 비즈니스 로직 구조
* - Controller: 사용자의 입력을 처리하고 적절한 서비스 메소드를 호출
* - Service: 핵심 비즈니스 로직을 수행
* - Repository: 데이터 저장소와의 상호 작용을 담당
* - DTO: 계층 간 데이터 전송을 위한 객체
* - Entity: 데이터베이스 테이블과 매핑되는 도메인 객체
*
* 4. 실행 및 관리
* - Main Class (App.java): 프로그램의 실행 진입점, 사용자와의 상호작용을 관리하고 전체 흐름을 제어
* */

public class App {
    public static void main(String[] args) {

    }
}
